run/gittracked/MHC/FkOmegaSST_BCS2_C+S/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 438.398;

boundaryField
{
    bottomoutlet
    {
        type            zeroGradient;
    }
    negyinlet
    {
        type            fixedValue;
        value           uniform 438.398;
    }
    posyinlet
    {
        type            fixedValue;
        value           uniform 438.398;
    }
    topoutlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 438.398;
    }
}


// ************************************************************************* //
