run/gittracked/MHC/FkOmegaSST_BCS2_C+S/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    3;
        alphaApplyPrevCorr  yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "alpha.*Diffusion"
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-7;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    pcorr
    {
        $p_rghFinal;
        tolerance       1e-3;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }

    "(U|k|omega)Final"
    {
        $k;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors 3;
    nNonOrthogonalCorrectors 2;
}

relaxationFactors
{
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
        p_rgh           0.3;
    }
}



// ************************************************************************* //
